# Formula Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaEditingEventArgs..::..Formula Property
FormulaEditingEventArgs Class See Also
---
Returns text of the formula that will be modified
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Formula { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Formula As String
	Get
```

Visual C++
---
```text
public:
property String^ Formula {
	String^ get ();
}
```

# See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace